scc2425-tukano/src/main/test/scc2425-artillery-tests/upload_shorts_out_warm_up.txt
Test run id: t46qm_kgeeat9qeygdy53fzngtxezheygfr_3g47
Parsed 201 rows
Parsed 201 rows
Parsed 201 rows
[...]
Phase started: Warm up (index: 0, duration: 10s) 22:26:26(+0000)

Phase completed: Warm up (index: 0, duration: 10s) 22:26:36(+0000)

--------------------------------------
Metrics for period to: 22:26:30(+0000) (width: 1.998s)
--------------------------------------

http.codes.200: ................................................................ 2
http.codes.204: ................................................................ 2
http.downloaded_bytes: ......................................................... 694
http.request_rate: ............................................................. 3/sec
http.requests: ................................................................. 5
http.response_time:
  min: ......................................................................... 63
  max: ......................................................................... 698
  mean: ........................................................................ 449.5
  median: ...................................................................... 441.5
  p95: ......................................................................... 596
  p99: ......................................................................... 596
http.response_time.2xx:
  min: ......................................................................... 63
  max: ......................................................................... 698
  mean: ........................................................................ 449.5
  median: ...................................................................... 441.5
  p95: ......................................................................... 596
  p99: ......................................................................... 596
http.responses: ................................................................ 4
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 2
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  2
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 63
  max: ......................................................................... 698
  mean: ........................................................................ 380.5
  median: ...................................................................... 63.4
  p95: ......................................................................... 63.4
  p99: ......................................................................... 63.4
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 440
  max: ......................................................................... 597
  mean: ........................................................................ 518.5
  median: ...................................................................... 441.5
  p95: ......................................................................... 441.5
  p99: ......................................................................... 441.5
vusers.completed: .............................................................. 2
vusers.created: ................................................................ 3
vusers.created_by_name.Upload short: ........................................... 3
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 508.9
  max: ......................................................................... 1321.7
  mean: ........................................................................ 915.3
  median: ...................................................................... 507.8
  p95: ......................................................................... 507.8
  p99: ......................................................................... 507.8


--------------------------------------
Metrics for period to: 22:26:40(+0000) (width: 7.655s)
--------------------------------------

http.codes.200: ................................................................ 28
http.codes.204: ................................................................ 28
http.downloaded_bytes: ......................................................... 9790
http.request_rate: ............................................................. 11/sec
http.requests: ................................................................. 55
http.response_time:
  min: ......................................................................... 60
  max: ......................................................................... 420
  mean: ........................................................................ 279
  median: ...................................................................... 333.7
  p95: ......................................................................... 407.5
  p99: ......................................................................... 415.8
http.response_time.2xx:
  min: ......................................................................... 60
  max: ......................................................................... 420
  mean: ........................................................................ 279
  median: ...................................................................... 333.7
  p95: ......................................................................... 407.5
  p99: ......................................................................... 415.8
http.responses: ................................................................ 56
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 28
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  28
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 60
  max: ......................................................................... 335
  mean: ........................................................................ 160.4
  median: ...................................................................... 159.2
  p95: ......................................................................... 314.2
  p99: ......................................................................... 320.6
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 383
  max: ......................................................................... 420
  mean: ........................................................................ 397.5
  median: ...................................................................... 399.5
  p95: ......................................................................... 415.8
  p99: ......................................................................... 415.8
vusers.completed: .............................................................. 28
vusers.created: ................................................................ 27
vusers.created_by_name.Upload short: ........................................... 27
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 477
  max: ......................................................................... 774.5
  mean: ........................................................................ 566.7
  median: ...................................................................... 561.2
  p95: ......................................................................... 742.6
  p99: ......................................................................... 757.6


All VUs finished. Total time: 12 seconds

--------------------------------
Summary report @ 22:26:40(+0000)
--------------------------------

http.codes.200: ................................................................ 30
http.codes.204: ................................................................ 30
http.downloaded_bytes: ......................................................... 10484
http.request_rate: ............................................................. 6/sec
http.requests: ................................................................. 60
http.response_time:
  min: ......................................................................... 60
  max: ......................................................................... 698
  mean: ........................................................................ 290.3
  median: ...................................................................... 383.8
  p95: ......................................................................... 424.2
  p99: ......................................................................... 596
http.response_time.2xx:
  min: ......................................................................... 60
  max: ......................................................................... 698
  mean: ........................................................................ 290.3
  median: ...................................................................... 383.8
  p95: ......................................................................... 424.2
  p99: ......................................................................... 596
http.responses: ................................................................ 60
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 30
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  30
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 60
  max: ......................................................................... 698
  mean: ........................................................................ 175.1
  median: ...................................................................... 159.2
  p95: ......................................................................... 320.6
  p99: ......................................................................... 333.7
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 383
  max: ......................................................................... 597
  mean: ........................................................................ 405.6
  median: ...................................................................... 399.5
  p95: ......................................................................... 424.2
  p99: ......................................................................... 441.5
vusers.completed: .............................................................. 30
vusers.created: ................................................................ 30
vusers.created_by_name.Upload short: ........................................... 30
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 477
  max: ......................................................................... 1321.7
  mean: ........................................................................ 589.9
  median: ...................................................................... 561.2
  p95: ......................................................................... 757.6
  p99: ......................................................................... 772.9